Model: "teacher"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= teacher_inputs_ (InputLaye  [(None, 18, 14, 1)]       0          r)                                                                                                                                teacher_reshape (Reshape)   (None, 18, 14, 1)         0                                                                           teacher_conv2d_1 (Conv2D)   (None, 18, 14, 20)        200                                                                         teacher_relu_1 (Activation  (None, 18, 14, 20)        0          )                                                                                                                                 teacher_pool_1 (AveragePoo  (None, 9, 7, 20)          0          ling2D)                                                                                                                           teacher_conv2d_2 (Conv2D)   (None, 9, 7, 30)          5430                                                                        teacher_relu_2 (Activation  (None, 9, 7, 30)          0          )                                                                                                                                 teacher_flatten (Flatten)   (None, 1890)              0                                                                           teacher_latent (Dense)      (None, 80)                151280                                                                      teacher_dense (Dense)       (None, 1890)              153090                                                                      teacher_reshape2 (Reshape)  (None, 9, 7, 30)          0                                                                           teacher_relu_3 (Activation  (None, 9, 7, 30)          0          )                                                                                                                                 teacher_conv2d_3 (Conv2D)   (None, 9, 7, 30)          8130                                                                        teacher_relu_4 (Activation  (None, 9, 7, 30)          0          )                                                                                                                                 teacher_upsampling (UpSamp  (None, 18, 14, 30)        0          ling2D)                                                                                                                           teacher_conv2d_4 (Conv2D)   (None, 18, 14, 20)        5420                                                                        teacher_relu_5 (Activation  (None, 18, 14, 20)        0          )                                                                                                                                 teacher_outputs (Conv2D)    (None, 18, 14, 1)         181                                                                        =================================================================Total params: 323731 (1.23 MB)Trainable params: 323731 (1.23 MB)Non-trainable params: 0 (0.00 Byte)_________________________________________________________________

Model: "teacher_scn_1"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= teacher_scn_1_inputs_ (Inp  [(None, 6, 14, 1)]        0          utLayer)                                                                                                                          teacher_reshape (Reshape)   (None, 6, 14, 1)          0                                                                           teacher_conv2d_1 (Conv2D)   (None, 6, 14, 8)          80                                                                          teacher_relu_1 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_pool_1 (AveragePoo  (None, 3, 7, 8)           0          ling2D)                                                                                                                           teacher_conv2d_2 (Conv2D)   (None, 3, 7, 12)          876                                                                         teacher_relu_2 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_flatten (Flatten)   (None, 252)               0                                                                           teacher_latent (Dense)      (None, 20)                5060                                                                        teacher_dense (Dense)       (None, 630)               13230                                                                       teacher_reshape2 (Reshape)  (None, 3, 7, 30)          0                                                                           teacher_relu_3 (Activation  (None, 3, 7, 30)          0          )                                                                                                                                 teacher_conv2d_3 (Conv2D)   (None, 3, 7, 12)          3252                                                                        teacher_relu_4 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_upsampling (UpSamp  (None, 6, 14, 12)         0          ling2D)                                                                                                                           teacher_conv2d_4 (Conv2D)   (None, 6, 14, 8)          872                                                                         teacher_relu_5 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_scn_1_outputs (Con  (None, 6, 14, 1)          73         v2D)                                                                                                                             =================================================================Total params: 23443 (91.57 KB)Trainable params: 23443 (91.57 KB)Non-trainable params: 0 (0.00 Byte)_________________________________________________________________

Model: "teacher_scn_2"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= teacher_scn_2_inputs_ (Inp  [(None, 6, 14, 1)]        0          utLayer)                                                                                                                          teacher_reshape (Reshape)   (None, 6, 14, 1)          0                                                                           teacher_conv2d_1 (Conv2D)   (None, 6, 14, 8)          80                                                                          teacher_relu_1 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_pool_1 (AveragePoo  (None, 3, 7, 8)           0          ling2D)                                                                                                                           teacher_conv2d_2 (Conv2D)   (None, 3, 7, 12)          876                                                                         teacher_relu_2 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_flatten (Flatten)   (None, 252)               0                                                                           teacher_latent (Dense)      (None, 20)                5060                                                                        teacher_dense (Dense)       (None, 630)               13230                                                                       teacher_reshape2 (Reshape)  (None, 3, 7, 30)          0                                                                           teacher_relu_3 (Activation  (None, 3, 7, 30)          0          )                                                                                                                                 teacher_conv2d_3 (Conv2D)   (None, 3, 7, 12)          3252                                                                        teacher_relu_4 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_upsampling (UpSamp  (None, 6, 14, 12)         0          ling2D)                                                                                                                           teacher_conv2d_4 (Conv2D)   (None, 6, 14, 8)          872                                                                         teacher_relu_5 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_scn_2_outputs (Con  (None, 6, 14, 1)          73         v2D)                                                                                                                             =================================================================Total params: 23443 (91.57 KB)Trainable params: 23443 (91.57 KB)Non-trainable params: 0 (0.00 Byte)_________________________________________________________________

Model: "teacher_scn_3"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= teacher_scn_3_inputs_ (Inp  [(None, 6, 14, 1)]        0          utLayer)                                                                                                                          teacher_reshape (Reshape)   (None, 6, 14, 1)          0                                                                           teacher_conv2d_1 (Conv2D)   (None, 6, 14, 8)          80                                                                          teacher_relu_1 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_pool_1 (AveragePoo  (None, 3, 7, 8)           0          ling2D)                                                                                                                           teacher_conv2d_2 (Conv2D)   (None, 3, 7, 12)          876                                                                         teacher_relu_2 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_flatten (Flatten)   (None, 252)               0                                                                           teacher_latent (Dense)      (None, 20)                5060                                                                        teacher_dense (Dense)       (None, 630)               13230                                                                       teacher_reshape2 (Reshape)  (None, 3, 7, 30)          0                                                                           teacher_relu_3 (Activation  (None, 3, 7, 30)          0          )                                                                                                                                 teacher_conv2d_3 (Conv2D)   (None, 3, 7, 12)          3252                                                                        teacher_relu_4 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_upsampling (UpSamp  (None, 6, 14, 12)         0          ling2D)                                                                                                                           teacher_conv2d_4 (Conv2D)   (None, 6, 14, 8)          872                                                                         teacher_relu_5 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_scn_3_outputs (Con  (None, 6, 14, 1)          73         v2D)                                                                                                                             =================================================================Total params: 23443 (91.57 KB)Trainable params: 23443 (91.57 KB)Non-trainable params: 0 (0.00 Byte)_________________________________________________________________

Model: "teacher_spr"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= teacher_spr_inputs_ (Input  [(None, 6, 14, 1)]        0          Layer)                                                                                                                            teacher_reshape (Reshape)   (None, 6, 14, 1)          0                                                                           teacher_conv2d_1 (Conv2D)   (None, 6, 14, 8)          80                                                                          teacher_relu_1 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_pool_1 (AveragePoo  (None, 3, 7, 8)           0          ling2D)                                                                                                                           teacher_conv2d_2 (Conv2D)   (None, 3, 7, 12)          876                                                                         teacher_relu_2 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_flatten (Flatten)   (None, 252)               0                                                                           teacher_latent (Dense)      (None, 20)                5060                                                                        teacher_dense (Dense)       (None, 630)               13230                                                                       teacher_reshape2 (Reshape)  (None, 3, 7, 30)          0                                                                           teacher_relu_3 (Activation  (None, 3, 7, 30)          0          )                                                                                                                                 teacher_conv2d_3 (Conv2D)   (None, 3, 7, 12)          3252                                                                        teacher_relu_4 (Activation  (None, 3, 7, 12)          0          )                                                                                                                                 teacher_upsampling (UpSamp  (None, 6, 14, 12)         0          ling2D)                                                                                                                           teacher_conv2d_4 (Conv2D)   (None, 6, 14, 8)          872                                                                         teacher_relu_5 (Activation  (None, 6, 14, 8)          0          )                                                                                                                                 teacher_spr_outputs (Conv2  (None, 6, 14, 1)          73         D)                                                                                                                               =================================================================Total params: 23443 (91.57 KB)Trainable params: 23443 (91.57 KB)Non-trainable params: 0 (0.00 Byte)_________________________________________________________________

Model: "cv1_cic"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 252)]             0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                4113                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout (Dropout)           (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 4129 (16.13 KB)Trainable params: 4096 (16.00 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv1_scn_1"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_1 (Dropout)         (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1441 (5.63 KB)Trainable params: 1408 (5.50 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv1_scn_2"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_2 (Dropout)         (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1441 (5.63 KB)Trainable params: 1408 (5.50 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv1_scn_3"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_3 (Dropout)         (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1441 (5.63 KB)Trainable params: 1408 (5.50 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv1_spr"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_4 (Dropout)         (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1441 (5.63 KB)Trainable params: 1408 (5.50 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv2_cic"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 252)]             0                                                                           reshape (Reshape)           (None, 18, 14, 1)         0                                                                           conv (QConv2D)              (None, 9, 7, 4)           16                                                                          relu0 (QActivation)         (None, 9, 7, 4)           0                                                                           flatten (Flatten)           (None, 252)               0                                                                           dropout_5 (Dropout)         (None, 252)               0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                4113                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_6 (Dropout)         (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 4145 (16.20 KB)Trainable params: 4112 (16.06 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv2_scn_1"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           reshape (Reshape)           (None, 6, 14, 1)          0                                                                           conv (QConv2D)              (None, 3, 7, 4)           16                                                                          relu0 (QActivation)         (None, 3, 7, 4)           0                                                                           flatten (Flatten)           (None, 84)                0                                                                           dropout_7 (Dropout)         (None, 84)                0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_8 (Dropout)         (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1457 (5.70 KB)Trainable params: 1424 (5.56 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv2_scn_2"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           reshape (Reshape)           (None, 6, 14, 1)          0                                                                           conv (QConv2D)              (None, 3, 7, 4)           16                                                                          relu0 (QActivation)         (None, 3, 7, 4)           0                                                                           flatten (Flatten)           (None, 84)                0                                                                           dropout_9 (Dropout)         (None, 84)                0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_10 (Dropout)        (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1457 (5.70 KB)Trainable params: 1424 (5.56 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv2_scn_3"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           reshape (Reshape)           (None, 6, 14, 1)          0                                                                           conv (QConv2D)              (None, 3, 7, 4)           16                                                                          relu0 (QActivation)         (None, 3, 7, 4)           0                                                                           flatten (Flatten)           (None, 84)                0                                                                           dropout_11 (Dropout)        (None, 84)                0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_12 (Dropout)        (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1457 (5.70 KB)Trainable params: 1424 (5.56 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

Model: "cv2_spr"_________________________________________________________________ Layer (type)                Output Shape              Param #   ================================================================= inputs_ (InputLayer)        [(None, 84)]              0                                                                           reshape (Reshape)           (None, 6, 14, 1)          0                                                                           conv (QConv2D)              (None, 3, 7, 4)           16                                                                          relu0 (QActivation)         (None, 3, 7, 4)           0                                                                           flatten (Flatten)           (None, 84)                0                                                                           dropout_13 (Dropout)        (None, 84)                0                                                                           dense1 (QDenseBatchnorm)    (None, 16)                1425                                                                        relu1 (QActivation)         (None, 16)                0                                                                           dropout_14 (Dropout)        (None, 16)                0                                                                           dense2 (QDense)             (None, 1)                 16                                                                          outputs (QActivation)       (None, 1)                 0                                                                          =================================================================Total params: 1457 (5.70 KB)Trainable params: 1424 (5.56 KB)Non-trainable params: 33 (136.00 Byte)_________________________________________________________________

